import { IPaintingDetail } from "../api/service/typing";

export const paintingList: IPaintingDetail[] = [
    {
        "id": 0,
        "title": "Постоянство Памяти",
        "img_path": "/image_placeholder.jpg",
        "short_description": "Известная картина, изображающая плавящиеся часы.",
        "description": "Картина 'Постоянство памяти' (1931) является одной из самых узнаваемых работ сюрреализма. Она изображает плавящиеся карманные часы в пейзаже, который символизирует относительность времени и нестабильность реальности."
    },
    {
        "id": 1,
        "title": "Крик",
        "img_path": "/image_placeholder.jpg",
        "short_description": "Эмоциональная картина, представляющая внутренние страхи и тревоги.",
        "description": "Картина 'Крик' (1893) изображает фигуру на мосту с ужасающим криком, выражая человеческое состояние отчаяния и страха."
    },
    {
        "id": 2,
        "title": "Звездная ночь",
        "img_path": "/image_placeholder.jpg",
        "short_description": "Одна из самых известных картин, изображающая вихри ночного неба.",
        "description": "'Звездная ночь' (1889) — это шедевр, где изображается завораживающее ночное небо, полное вихрей и светящихся звезд, создавая уникальное представление о природе."
    },
    {
        "id": 3,
        "title": "Афинская школа",
        "img_path": "/image_placeholder.jpg",
        "short_description": "Фреска, изображающая знаменитых философов античности.",
        "description": "Фреска 'Афинская школа' (1511) изображает Платона и Аристотеля в центре, окруженных философами и учеными, представляя триумф разума и научной мысли."
    },
    {
        "id": 4,
        "title": "Ночной дозор",
        "img_path": "/image_placeholder.jpg",
        "short_description": "Известная картина, изображающая вооруженную городскую милицию.",
        "description": "'Ночной дозор' (1642) — это шедевр, который изображает членов амстердамской стрелковой роты, подготовленных к выполнению своего долга. Картина выделяется своим драматизмом и светотеневым контрастом."
    },
    {
        "id": 5,
        "title": "Сотворение Адама",
        "img_path": "/image_placeholder.jpg",
        "short_description": "Фреска, изображающая момент создания человека.",
        "description": "'Сотворение Адама' (1512) — одна из фресок Сикстинской капеллы, изображающая библейскую сцену, где Бог протягивает руку к Адаму, даруя ему жизнь. Это один из самых узнаваемых образов в истории искусства."
    }
];
